[Setting]
Language=繁體中文
MainSoftWareInfo = CH347 高速編程器

[FileMenu]
File     = 文件
Open     = 打開
Save     = 保存
SaveAs   = 另存爲
FileComb = 文件合併
Close    = 退出
[BufferMenu]
Buffer   = 緩衝區
Fill     = 填充
Find     = 查找
FindNext = 查找下一個
Jump     = 跳轉

[ProgramMenu]
Program    = 編程操作
Auto       = 自動
BlankCheck = 查空
Erase      = 擦除
Write      = 寫入
Read       = 讀出
Verify     = 校驗
Mass      = 批量燒錄
ChipCheck  = 晶片檢測
AutoSel    = 自動選項


BtnAuto       = 自動
BtnBlankCheck = 查空
BtnErase      = 擦除
BtnWrite      = 寫入
BtnRead       = 讀出
BtnVerify     = 校驗
BtnMass       = 批量
BtnStop       = 停止
BtnChipCheck  = 檢測
BtnChipFind   = 查找

[ProjectMenu]
Project    = 工程
Open       = 打開
Save       = 保存
Offline    = 離線工程

[HardMenu]
HardWare   = 硬體
HardInfo   = 硬體信息
FirmUpdate = 固件更新
ChipDb     = 晶片管理
SelfCheck  = 自檢

[LanguageMenu]
Language    = 語言

[AboutMenu]
Device      = 設備
About       = 關於

[HelpMenu]
Help        = 幫助

[ChipInfo]
Chip        = 晶片
ChipType    = 類型：
Manauf      = 廠商：
ChipName    = 晶片名稱：
ChipInfo    = 晶片信息
ChipCap     = 容量：
PageSize    = 頁大小：
OtpSize     = OTP大小：
Voltage     = 晶片電壓：
ChipChnTitle = 燒錄模式
ChipChn1    = 普通模式
ChipChn2    = 一拖二模式
ChipChn3    = SOP16燒錄

[Button]
OK            = 確定
Cancel        = 取消
Select        = 選擇

[FileInport]
ODTitle                = 選擇打開的文件
FileInportTitle        = 文件導入緩存區編輯
BufferStartAddr        = 緩存區起始地址(HEX)：

[BufferFill]
FillDialogTitle        = 緩存區填充設置
FillStartAddr          = 起始地址(HEX):
FillLen                = 填充長度(HEX):
FillValue              = 填充數值(HEX):
FillRandom             = 隨機填充

[BufferFind]
BufferFindTitle        = 查找緩存區
BufferFindValue        = 查找內容(HEX):

[BufferJump]
BufferJumpTitle        = 緩存區跳轉
BufferJumpAddr         = 跳轉地址(HEX):
BufferCurrentAddr      = 當前地址(HEX):

[AutoSel]
AutoSelTitle           = 自動選項
AutoSelIDCheck         = ID校驗
AutoSelErase           = 擦除
AutoSelWrite           = 寫入
AutoSelVerify          = 校驗

[HardInfo]
HardInfoTitle           = 硬體信息
DevName                 = 設備名稱：
HardVersion             = 硬體版本：
SoftWareVersion         = 固件版本：
DevSN                   = 序列號：

[FirmUpdate]
ODTitle                 = 選擇固件升級文件
FirmPageTitle           = 固件版本更新
StartButton             = 啓動更新


[Log]
LogStaSuccess           = 成功！
LogStaError             = 錯誤！
LogFileOpen             = 打開文件，文件名：
LogFileSave             = 保存文件，文件名：
LogFileSaveAs           = 文件另存为：

LogOperatTimeTitle      = 共耗時
LogOperatTime           = 秒

LogChipCheckOK          = 檢測晶片，晶片名爲：
LogChipCheckCommError   = 檢測晶片，通訊錯誤.
LogChipCheckError       = 檢測晶片，未檢測到晶片.

LogChipErase            = 正在擦除晶片......
LogChipEraseChipErr     = 擦除錯誤！請先選擇晶片型號！
LogChipEraseCommError   = 擦除通訊錯誤，請重試.
LogChipEraseSuccess     = 擦除完成.耗時

LogChipWrite            = 正在寫入數據......
LogChipWriteChipErr     = 寫入錯誤！請先選擇晶片型號！
LogChipWriteCommError   = 寫入通訊錯誤，請重試.
LogChipWriteFileError   = 寫入錯誤.請先打開一個文件到緩存區！
LogChipWriteFileName    = 寫入晶片，
LogChipWriteFileLen     = 寫入長度：
LogChipWriteSuccess     = 寫入成功.耗時


LogChipReadChip         = 正在讀取......
LogChipReadSuccess      = 讀取晶片，完成！耗時
LogChipReadError        = 讀取錯誤，請重試！

LogChipVerifyChip       = 正在校驗......
LogChipVerifySuccess    = 校驗晶片，成功！耗時
LogChipVerifyError      = 校驗錯誤，請重試！

DevConStaOnline         = 設備已連接
DevConStaOffline        = 設備離線
DevConVersion           = 設備版本：
DevConLogDevice         = 檢測到編程器，型號：
DevConLogSN             = 產品序列號：


LogChipBankCheck        =  查空操作.
LogChipBankTrue         =  該晶片是空的，可以直接寫入.
LogChipBankFalse        =  該晶片不是空的，請擦除後再寫入.	

LogChipDetect           = 檢測並識別到晶片，型號：
LogChipSelect           = 手動選擇晶片完成，型號：
LogChipDetectCapcity    = 容量：
LogChipDetectID         = 晶片ID：
LogChipDetectUnknown    = 檢測到晶片，但未識別出晶片型號.晶片ID：
LogChipDetectError      = 晶片檢測異常.
LogChipDetectNULL       = 未檢測到晶片.

LogChipMassStart        = 批量燒錄開始，請點擊“停止”按鈕停止.
LogChipMassStop         = 批量燒錄已停止，將在本次燒錄完成後停止.
LogChipMassAutoStop     = 30秒內沒有檢測到芯片，已自動停止了批量燒錄.







